Repository: anttijuu/CourseDeadlineCounter
Catalog: CourseDeadlineCounter/Localizable.xcstrings
Source language: en
Languages: fi

source: %@ calendar time left
fi: %@ kalenteriajasta jäljellä

source: %@ left to go
fi: %@ jäljellä

source: %lld days before deadline
fi: %lld päivää ennen deadlinea

source: A goal to reach in the course
fi: Kurssilla saavutettavan deadlinen kuvaus

source: Add new course
fi: Lisää uusi kurssi

source: Add new deadline
fi: Lisää uusi deadline

source: ago
fi: sitten

source: All
fi: Kaikki

source: Cancel
fi: Peruuta

source: Close
fi: Sulje

source: Confirm Delete
fi: Vahvista poisto

source: Could not delete the file: %@
fi: Tiedostoa ei voitu poistaa: %@

source: Could not save Course
fi: Kurssia ei voitu tallentaa

source: Could not save deadline
fi: Deadlinea ei voitu tallentaa

source: Course deadline is near
fi: Kurssin deadline lähestyy

source: Course is now %lld days old
fi: Kurssi on nyt %lld päivää vanha

source: Course List
fi: Kurssilista

source: Course must have a name
fi: Kurssilla on oltava nimi

source: Course name:
fi: Kurssin nimi:

source: Course start date was moved %lf days
fi: Kurssin aloituspäivää siirrettiin %lf päivää

source: Courses must have a unique name
fi: Kursseilla täytyy olla eri nimet

source: Date issue: %@
fi: Päivämääräongelma: %@

source: Deadline becomes hot
fi: Deadlinesta tulee kuuma

source: Deadline goal:
fi: Deadlinen tavoite:

# Deadline in %@ is on %@)
source: Deadline in %1$@ is on %2$@)
fi: Kurssin %1$@ deadline on %2$@

source: Deadline is at the symbol's location on the timeline
fi: Deadline on aikajanalla sen symbolin kohdalla

source: Deadline must have a goal
fi: Deadlinella on oltava tavoite

source: Deadline passed
fi: Deadline on mennyt

source: Delete Course
fi: Poista kurssi

source: Delete Deadline
fi: Poista deadlne

source: Delete this deadline? This cannot be undone.
fi: Poista tämä deadline? Tätä ei voi perua.

source: Do you wish to move deadline dates accordingly?
fi: Haluatko siirtää deadline -päivämääriä vastaavasti?

source: Edit Course
fi: Muokkaa kurssia

source: Edit deadline
fi: Muokkaa deadlinea

source: Enter a symbol name or pick one from below
fi: Anna symbolin nimi tai valitse listalta

source: Error
fi: Virhe

source: Failed to save the course deadlines, please check app permissions.
fi: Tietoja deadlineista ei voitu tallentaa, tarkista annoitko sovellukselle luvan käyttää Dokumentit -kansiota.

source: File does not exist, cannot read it.
fi: Tiedostoa ei voi lukea koska sitä ei ole olemassa.

# Has %lld deadlines (%lld completed)
source: Has %lld deadlines (%2$lld completed)
fi: %lld deadlinea (%2$lld ohitettu)

source: If deadline is not met, course is considered failed or grade is lowered
fi: Jos deadline missaa, kurssisuoritus keskeytyy tai arvosana alenee

source: Is deal breaker?
fi: Vaikuttaa arvosteluun?

source: Move deadline dates too?
fi: Siirrä myös deadline-päivämääriä?

source: Move the the course to Trash?
fi: Siirrä kurssi Roskakoriin?

source: New Course
fi: Uusi kurssi

source: Next deadline in
fi: Seuraava deadline

source: No
fi: Ei

source: No courses to show
fi: Ei kursseja näytettäväksi

source: No deadlines
fi: Ei deadlineja

source: Now
fi: Nyt

source: Pick
fi: Valitse

source: Save
fi: Tallenna

source: See SF Symbols app for available symbols
fi: Katso symboleita SF Symbols -apista

source: Select a symbol
fi: Valitse symboli

source: Select course from the list or create a new course
fi: Valitse kurssi listalta tai luo uusi kurssi

source: Set deadline:
fi: Aseta deadline:

source: SF Symbol name:
fi: SF Symbolin nimi:

source: Show ongoing courses
fi: Näytä meneillään olevista kursseista

source: Start date:
fi: Aloituspäivä:

source: Starts at %@
fi: Alkaa %@

source: Starts in %lld days
fi: Alkaa %lld päivän kuluttua

source: Symbol name
fi: Symbolin nimi

source: Timeline
fi: Aikajana

source: until deadline
fi: deadlineen

source: Yes
fi: Kyllä
